// how many days in each month
const monthDayRange = {
  1: 31,
  2: 29,
  3: 31,
  4: 30,
  5: 31,
  6: 30,
  7: 31,
  8: 31,
  9: 30,
  10: 31,
  11: 30,
  12: 31,
};

// array of zodiac animals
const ZodiacArray = [
  "القرد",
  "الديك",
  "الكلب",
  "الخنزير",
  "الفار",
  "الثور",
  "النمر",
  "الارنب",
  "التنين",
  "الثعبان",
  "الحصان",
  "العنزة",
];

// object lookup w/ functions to process different Horoscope Signs inside each month
const handleMonths = {
  1: function (day) {
    if (day <= 19) {
      return "الجدي";
    } else {
      return "الدلو";
    }
  },
  2: function (day) {
    if (day <= 18) {
      return "الدلو";
    } else {
      return "الحوت";
    }
  },
  3: function (day) {
    if (day <= 20) {
      return "الحوت";
    } else {
      return "الحمل";
    }
  },
  4: function (day) {
    if (day <= 19) {
      return "الحمل";
    } else {
      return "الثور";
    }
  },
  5: function (day) {
    if (day <= 20) {
      return "الثور";
    } else {
      return "الجوزاء";
    }
  },
  6: function (day) {
    if (day <= 20) {
      return "الجوزاء";
    } else {
      return "السرطان";
    }
  },
  7: function (day) {
    if (day <= 22) {
      return "السرطان";
    } else {
      return "الاسد";
    }
  },
  8: function (day) {
    if (day <= 22) {
      return "الاسد";
    } else {
      return "العذراء";
    }
  },
  9: function (day) {
    if (day <= 22) {
      return "العذراء";
    } else {
      return "الميزان";
    }
  },
  10: function (day) {
    if (day <= 22) {
      return "الميزان";
    } else {
      return "العقرب";
    }
  },
  11: function (day) {
    if (day <= 21) {
      return "العقرب";
    } else {
      return "القوس";
    }
  },
  12: function (day) {
    if (day <= 21) {
      return "القوس";
    } else {
      return "الجدي";
    }
  },
};
// 0000000000000000000000000000000000000000000000000000
/**
 * show pros and cons of horo.
 * @param {string} horo - horo name.
 * @return {object} - pros, cons string.
 */
function prosAndConsHoro(horo) {
  let pros,
    cons,
    type,
    planet,
    favorite,
    avoid,
    public = null;
  switch (horo) {
    case "الجدي":
      planet = "زحل";
      favorite = "العائلة - الموسيقى - التقاليد.";
      avoid = "يمكن أن يكره كل شيء في مرحلة معينة.";
      public =
        "يمكن أن يكون مولود الجدي تقليدياً وجادّاً بطبيعته، وهو شخص عملي ويستطيع تحمّل المسؤولية، ويمتلك استقلالاً داخيلاً يمكّنهم من تحقيق النجاح في حياتهم المهنية والاجتماعية، ويتميز مولود الجدي بقدرته على وضع الخطط وضبط النفس والقيادة وإدارة العديد من الموظفين. يتعلم الجدي من أخطائه ويصل إلى القمة والنجاح بالاعتماد على تجاربه وخبراته، لكنه شخص عنيد ويمكن أن يجد صعوبة بتقبّل اختلافات الأشخاص.";
      pros = "المسؤولية - ضبط النفس - الإدارة.";
      cons = "التنازل - التشاؤم - عدم التسامح.";
      type = "ترابي";
      break;
    case "الدلو":
      planet = "زحل - أورانوس.";
      favorite = "المرح مع الأصدقاء - مساعدة الآخرين - الاستماع الجيد.";
      avoid = "القيود - الوحدة - الملل.";
      public =
        "مولود الدلو هو شخص خجول وهادئ، وقد يبدو أحيانأً غريب الأطوار، لكنه في الحقيقة يتميز بعمق التفكير والقدرة على حل المشكلات ومساعدة الآخرين. يتكيف مولود الدلو مع مختلف الظروف ويحب أن يكون محاطاً بالأشخاص من حوله، لكنه يحتاج أن يبقى بمفرده من وقت لآخر ليستعيد طاقته، وهو قادر على تحديد أهدافه على المدى البعيد، ويكره القيود والحدود، بسبب اهتمامه بالحرية والمساواة بين الجميع.";
      pros = "المزاجية - العناد - التحفّظ.";
      cons = "عنيد، ومشاكس، ومستقلّ، ويتّسم بالذّكاء، وتصرّفاته غير متوقّعة.";
      type = "هوائي";
      break;
    case "الحوت":
      planet = "المشتري - نبتون.";
      favorite = "الرومانسية - الموسيقى - النوم - السباحة.";
      avoid = "الانتقاد - القسوة - معرفة كل شيء.";
      public =
        "يتصف مولود الحوت بأنه شخص ودود ولطيف وكريم ومخلص، يتعاطف مع الآخرين ويقدم لهم المساعدة دون أن ينتظر مقابل، يحب الفن والموسيقى ويمكن أن يكون صديقاً رائعاً، ويعطي الأولوية لاحتياجات أصدقائه ويقدم لهم الرعاية والاهتمام ويسارع لحل مشكلاتهم.";
      pros = "الحنان - الحدس - الحكمة.";
      cons = "الخوف - الثقة الزائدة - الرغبة بالهروب من الواقع.";
      type = "مائي";
      break;
    case "الحمل":
      planet = "المريخ";
      favorite = "الكسل - التأخير - العمل الخالي من الإبداع.";
      avoid = "الكسل - التأخير - العمل الخالي من الإبداع.";
      public =
        "يبحث مولود الحمل دائماً عن المنافسة والسرعة، وهو متفوق في كل أمر يخوضه، ويمتلك مهارات تنظيمية عالية، ويستطيع إتمام الكثير من الأمور في وقت واحد، كما أن شخصيته قوية ويمكن أن يحارب من أجل تحقيق أهدافه، فهو شجاع بطبعه ولديه عزيمة قوية وإصرار على ما يريد، وهو مفعم بالنشاط والحيوية والشباب بغض النظر عن سنّه.";
      pros = "الشجاعة - الثقة - العزيمة - الحماس - التفاؤل - الصدق.";
      cons = "الاندفاع - العدوانية - المزاج سريع التقلّب.";
      type = "ناري";
      break;
    case "الثور":
      planet = "الزهرة";
      favorite = "الطبخ - الموسيقى - الرومانسية - العمل باليد.";
      avoid = "التغيرات المفاجئة - انعدام الأمان - التعقيد.";
      public =
        "شعر مولود برج الثور بحاجةٍ مستمرةٍ للمحبّة والمتعة، وهو من الأشخاص الذين يمكن الاعتماد عليهم والوثوق بهم، ولديه قدرة على رؤية الأشياء من منظور عمليّ وواقعيّ، يمكن أن يكون مولود الثور موظفاً مميزاً، وصديقاً رائعاً تستمر صداقته لسنوات طويلة، وهو موجود دائماً عندما يحتاج إليه الآخرون، ليقدم المساعدة على أكمل وجه، ويمكن القول أنه شخص مخلص، وعاشق للتحدّي.";
      pros = "المسؤولية - الثبات - الصبر - الإخلاص.";
      cons = "العناد - الغيرة.";
      type = "ترابي";
      break;
    case "الجوزاء":
      planet = "عطارد";
      favorite = "الموسيقى - الكتب - الرحلات القصيرة - التحدث مع الأشخاص.";
      avoid = "الوحدة - الروتين.";
      public =
        "يمتلك مولود الجوزاء شخصيتين مختلفتين في وقت واحد، وهو شخص يحب التسلية، والمرح، والتواصل مع الآخرين، وقد يميل بشكل مفاجئ للجدّية، وهو بشكل عام شخص فضوليّ يحب الاستكشاف ومعرفة كلّ شيء، كما يمتلك مولود الجوزاء عقلاً قابلاً للتغيير والانفتاح، وهذا ما يجعله مبدعاً بمجالات الفنّ والكتابة، إضافةً لامتلاكه مهارات أخرى تجعله بارعاً في التجارة والقيادة.";
      pros = "الفضول - الحنان - سرعة التعلّم - القدرة على التكيّف.";
      cons = "العصبية - التقلّب - التردد.";
      type = "هوائي";
      break;
    case "السرطان":
      planet = "القمر";
      favorite = "الاسترخاء - الفن -مساعدة الآخرين.";
      avoid = "الغرباء - الإفصاح عن حياته الخاصة.";
      public =
        "مولود برج السرطان عاطفي وحساس، ويهتم بشؤون أسرته ومنزله، يتعلق بالأشخاص لدرجة كبيرة ويبقى مخلصاً لهم، وهو قادر على التعاطف مع آلام ومعاناة الآخرين ويسارع لمساعدتهم، يصعب عليه أحياناً التأقلم مع الأوضاع الجديدة، وقد يفتقر للصبر بسبب مزاجيته، لكنه يحرص دائماً على التعامل مع الآخرين بتفهّم وحرص، وينتظر أن يعامله الآخرون بالمثل.";
      pros = "الإبداع - الإخلاص - العاطفة - الإقناع.";
      cons = "المزاجية - التشاؤم - التلاعب.";
      type = "مائي";
      break;
    case "الاسد":
      planet = "الشمس";
      favorite = "الألوان الزاهية - الأشياء باهظة الثمن - المرح مع الأصدقاء.";
      avoid = "أن يتم تجاهله - المواقف الصعبة.";
      public =
        "واليد الأسد هم قادة بطبيعتهم، فهم يتمتعون بثقة عالية في النفس، ولديهم قدرة على تحقيق أي شيء يريدونه، وغالباً ما يملك مولود الأسد الكثير من الأصدقاء نظراً لطبيعته الكريمة والمرحة، وهو طيب القلب ويحب الحياة، ويستطيع أن يعتمد على نفسه وأفكاره في حل المشكلات والمواقف المعقدة، وهو شخص لا يعرف الخوف ومن الصعب إيذائه أو تدميره.";
      pros = "الكرم - الإبداع - طيبة القلب - المرح - روح الدعابة.";
      cons = "العناد - الكسل - الغرور.";
      type = "ناري";
      break;
    case "العذراء":
      planet = "عطارد";
      favorite = "الطعام الصحي - الكتب - الطبيعة - النظافة.";
      avoid = "الغلظة بالتعامل - طلب المساعدة.";
      public =
        "يهتم مولود برج العذراء بأدق التفاصيل ويتمتع بإحساس عالٍ بالإنسانية وبشخصية قوية، وهو يميل لكل ما هو محافظ ومنظم، فهو شخص منظم بشكل عام، وحتى إن حلّ بأغراضه بغض الفوضى، فإن أحلامه وأفكاره تكون منظمة ومحددة بدقة. يشعر مولود العذراء بالقلق الدائم ويخاف أن تفوته بعض التفاصيل، وهو شخص كثير الانتقاد ويهتم بأمور قد لا يهتم بها أحد غيره.";
      pros = "الوفاء - الطيبة - الاجتهاد.";
      cons = "القلق - الخجل - انتقاد الذات.";
      type = "ترابي";
      break;
    case "الميزان":
      planet = "الزهرة";
      favorite = "التناغم - اللطف - المشاركة - الهواء الطلق.";
      avoid = "العنف - الظلم - الأصوات العالية.";
      public =
        "مواليد برج الميزان مسالمون وعادلون بطبعهم ويكرهون الوحدة، ويهتمون بشكل كبير بالعدل والمساواة والتوازن في كل شيء، يفعلون كل ما بوسعهم لتجنب الصراعات والعيش في سلام، ويحرصون على أن يمتلئ وقتهم بالفن والجمال والموسيقى، ويتميز مواليد هذا البرج برجاحة العقل والذكاء الشديد، وغالباً ما يكون لديهم رأيهم الخاص في الأمور، وهم من الأشخاص الذين يصعب نسيانهم.";
      pros = "التعاون - الدبلوماسية - الكرم - العدل.";
      cons = "التردد - تجنب المواجهة.";
      type = "هوائي";
      break;
    case "العقرب":
      planet = "المريخ - بلوتو";
      favorite = "الحقائق - الشغف - الصداقات الطويلة.";
      avoid = "خيانة الأمانة - كشف الأسرار - الأشخاص السلبيين.";
      public =
        "مولود العقرب هو شخص عاطفي وحازم بطبعه، العاطفة مهمة بالنسبة له ويمكن الوثوق به وائتمانه على الأسرار، يستمر العقرب بالبحث عن الحقائق حتى يجدها، وهو أيضاً قائد عظيم وكثير الحيلة، يُعرف بسلوكه الهادئ ومظهره الغامض، وقد يبدو أكبر سناً مما هو عليه، ومن مميزاته أنه مخلص لدرجة كبيرة، لذلك فهو يكره الغدر وخيانة الأمانة.";
      pros = "الشجاعة - العاطفة - العناد.";
      cons = "الغيرة - عدم الثقة - السرية الزائدة.";
      type = "مائي";
      break;
    case "القوس":
      planet = "المشتري";
      favorite = "الحرية - السفر - الفلسفة.";
      avoid = "القيود - كثرة التفاصيل.";
      public =
        "مواليد برج القوس يتميزون بعقلهم المنفتح وحيويتهم الدائمة وحماسهم وتفاؤلهم، وميلهم للفضول والفلسفة، وحبهم الكبير للسفر، ولا يجدون مشكلة في التجول حول العالم بحثاً عن معنى الحياة والحرية. يحب مولود القوس التغييرات المستمرة ويمكن أن ينفذ صبره بسرعة، ويستطيع أن يترجم أفكاره إلى أفعال ونتائج ملموسة، كما أنه يمتلك روح الدعابة وخفة الظل.";
      pros = "العطاء - المثالية - روح الفكاهة.";
      cons = "قلة الصبر - عدم الدبلوماسية - كثرة الوعود.";
      type = "ناري";
      break;
  }
  return {
    planet,
    favorite,
    avoid,
    public,
    pros,
    cons,
    type,
  };
}

function prosAndConsZodiac(zodiac) {
  let pros,
    cons,
    harmony,
    public = null;
  switch (zodiac) {
    case "القرد":
      pros = "فكاهي، سريعة البديهة، مقنع";
      cons = "سطحي، خبيث، غير جدير بالثقة";
      harmony = "الأفعى، الفأر والتنين";
      public =
        "حبه للأشياء ودرجة حماسه لها هي التي تحدد مقدار عمله تجاهها وتجعله من الأبراج الصينية المختلفة، فما يحرك أصحاب برج القرد في الحياة هو الشغف، طالما أنه يشعر بالشغف تجاه ما يفعله فسوف يفعل ما في وسعه ليكون في أفضل صورة وإذا لم يحبه ولم يشعر بالشغف تجاه فإنه يعامله بإهمال وإن كان شيء مجبرا لفعله. يقدر أصحاب برج القرد العلاقات الإنسانية والعاطفية كذلك، فهم مليئون بالشغف للتعرف على أشخاص جدد وحياتهم في العادة مليئة بالكثير من الأشخاص.";
      break;
    case "الديك":
      pros = "شغوف، يتحمل المسؤولية، شجاع";
      cons = "عنيد، متسلط، عدواني";
      harmony = "التنين، الثور، الأفعي";
      public = "يهتم أصحاب برج الديك من الأبراج الصينية، بالأخرين اهتماما خاصا، يهتمون بمشاعرهم وبما يفكرون فيه لهذا هو صديق وحبيب مميز للغاية، كذلك هم مبدعون للغاية في مجال عملهم وفي الغالب يعملون في المجالات الإبداعية مثل الرسم والتصوير وغيرها. يخطط صحاب برج الديك لكل شيء في حياته ولا يترك أي شيء للصدفة، هذا إضافة إلى رغبتهم القوية في النجاح وعمل المشاريع وقضاء وقتا طويلا في العمل من أجل الوصول للقمة.";
      break;
    case "الكلب":
      pros = "صادق، كريم، متواضع";
      cons = "متشائم، انطوائي، عنيد";
      harmony = "الأرنب، النمر، الحصان";
      public = "أكثر الأبراج الحساسة والصادقة والتي تتميز بالوفاء، البرج قبل الأخير من الأبراج الصينية هو برج الكلب، فأصحابه هم مثال للصديق الوفي الحساس الذي يتحمل مسؤولية الأخرين ولا يخذلهم أبدا، كذلك هم معروفون بحبهم للعمل وطاعتهم وولائهم لكل ما يحبونه في الحياة. هو شخصية هادئة في الكثير من المواقف التي تمر به إلا إذا حاولت ان تجرح كرامته أو كرامة من يحب فستجد تحول تام في هذه الشخصية وربما تجرحك دون أن تفكر كثيرا.";
      break;
    case "الخنزير":
      pros = "كريم، مخلص، ملتزم";
      cons = "سحطي، شهواني، ساذج";
      harmony = "النمر، الأرنب، العنزة";
      public = "يتمتع أصحابه بمنطقية كبيرة في تفكيرهم تجعلهم قادرين على إيجاد حلول لأصعب المشكلات دون عناء، كذلك هم أشخاص يحبون العمل وغالبا ما يكونوا من الأغنياء مع محافظتهم على الاستمتاع بحياتهم. هم أشخاص اجتماعية يقدرون اللحظات السعيدة التي يعيشونها مع الآخرين، ويحبون مساعدة الأخرين إلا انهم يقعون ضحية الاستغلال في كثير من الأحيان.";
      break;
    case "الفار":
      pros = "ذكي، قابل للتكيف، مرح";
      cons = "متقلب المزاج، عصبي، أناني";
      harmony = "الثور، القرد، التنين";
      public = "برج الفأر من الأبراج الصينية التي يمتاز مواليدها بأنهم يحبون جمع الأموال ويحرصون على عدم إهدارها أيضا ولهذا لا يواجهون العديد من الأزمات المادية في حياتهم، كذلك إذا أهداك صاحب برج الفأر هدية فيجب أن تعلم أنك شخص مميز بالنسبة له فهو لا يفعل هذا في العادة. أصحاب هذا البرج الصيني هم أشخاص حساسون بدرجة كبيرة ولا يميلون لنيل الإعجاب من الآخرين دوماً، وعندما يقررون المخاطرة بشيء ما فعادة ينجحون.";
      break;
    case "الثور":
      pros = "متعاون، صبور، طيب";
      cons = "عصبي، انطوائي، ديكتاتوري";
      harmony = "الفأر، الأفعى، الديك";
      public = "أما برج الثور فمن الأبراج الصينية الذي يتميز مواليده بإحساس عالي بالمسؤولية وأنهم مجتهدون في عملهم، إلا أنهم شخصيات غير مفهومة على الإطلاق، ومن الصعب أن تضعهم في قالب محدد. غير رومانسي إطلاقا، وعصبيين بدرجة كبيرة فإذا فقدوا السيطرة على أعصابهم فإن الثور بداخلهم سينطلق ولن يستطيع أحد إيقافه.";
      break;
    case "النمر":
      pros = "مستقل، محب للحياة، رومانسي";
      cons = "متهور، عصبي، غير صبور";
      harmony = "الخنزير، الكلب، الحصان";
      public = "ومن الأبراج الصينية أيضا برج النمر، ومواليد هذا البرج يتميزون بأنهم شخصيات مستقلة بطبيعتها وتميل إلى أن تكون قائد أي فريق توضع فيه، فهم أصحاب شخصية قيادية تحظى باحترام وتقدير من حولها لأنه تقدر ذاتها بدرجة كبيرة. متهوريين وهذا هو سبب فشلهم في العديد من الأمور إلى أن النمر لا يقبل بالهزيمة في أي أمر أو حتى نقاش بسيط، فستجده في النهاية قام بالنهوض ومتابعة ما بدأه حتى النجاح.";
      break;
    case "الارنب":
      pros = "مطيع، حساس، لطيف";
      cons = "مغرور، غيور، متغير المزاج";
      harmony = "الكلب، الخنزير، العنزة";
      public = "وبرج الأرنب من الأبراج الصينية التي يولد أصحابها بشخصية لطيفة وكريمة وهادئة، هم أذكياء بالفطرة ومحبين للأناقة والاعتناء بمظهرهم، كذلك اعتنائهم بالتفاصيل في كل شيء يجعلهم ناجحين في حياتهم العملية بدرجة كبيرة. لا يقعون في الحب بسهولة ولكن عندما يحدث هذا فإنهم سيهتمون بشريكهم للغاية ويبذلون كل ما في وسعهم ليصبح سعيد.";
      break;
    case "التنين":
      pros = "شجاع، عاطفي، مرن";
      cons = "عصبي، حاد الطباع، مغرور";
      harmony = "الديك، القرد، الفأر";
      public = "الشخصية الغامضة والقلب المليء بالرغبة في المغامرة والحساس في الوقت ذاته، هى ما يُميز واحدا من أهم الأبراج الصينية وهو برج التنين، فمواليد هذا البرج شخصيات مختلفة في كل شيء ويجمعون العديد من المتناقضات بداخلهم. قد يبدو عليهم الكسل أحيانا، ولكن إذا قرروا فعل شيء ما فستجدهم في غاية النشاط والحماس حتى إنهاء المهمة المطلوبة.";
      break;
    case "الثعبان":
      pros = "ذكي، حساس، مبدع";
      cons = "خبيث، مشاكس، غير صريح";
      harmony = "القرد، الديك، الثور";
      public = "قد يبدو لك صاحب برج الأفعى من الأبراج الصينية التي يكون أصحابها من الخارج بتمتعون بالبرود في رد الفعل ولا يعطون الانفعال أو الانطباع الذي تنتظره منه، ولكن في الحقيقة أن مشاعرهم من الداخل رقيقة للغاية ويتحمسون لأي فكرة جديدة ولكنهم غالبا ما يفشلون في التعبير عن تلك المشاعر في مختلف مواقف حياتهم. يميلون للمثالية، وحبهم للتملك يقعهم في العديد من المشاكل، ولكونهم شخصيات تعشق الحماس والتصميم على أي شيء فإن عدوهم الأول هو الكسل.";
      break;
    case "الحصان":
      pros = " حيوي، جذاب، لبق";
      cons = "غير صبور، قلق، أناني";
      harmony = "العنزة، النمر، الكلب";
      public = "الحرية هي كلمة السر ومفتاح شخصية أحد أهم الأبراج الصينية، وهم أصحاب برج الحصان، هم شخصيات تتمتع بطاقة إيجابية وحب للحياة دوما تجعلهم يرغبون في مواصلة العمل ودفع أنفسهم إلى الأمام على المستوى الشخصي والعملي كذلك. وعلى الرغم من الطاقة الكبيرة التي يتمتعون بها إلا أنهم يفقدون حماسهم سريعا ويعتبر هذا من أسوأ عيوبهم، إضافة إلى عدم قدرتهم على حفظ الأسرار.";
      break;
    case "العنزة":
      pros = " ودود، حساس، مبدع";
      cons = "متردد، مزاجيين، اعتمادي";
      harmony = "الحصان، الخنزير، الأرنب";
      public = "أصحاب برج العنزة وهو من الأبراج الصينية المُميزة، يتمتعون بقلب طيب ورقيق، فهم قد يفضلون ألا يطلبوا شيء من أي شخص حتى لا يشعرون بأنهم حمل ثقيل على أحد، كذلك فإنه لا يحب المواجهة ولذلك يفضل اتخاذ قراراته بمفرده في أي أمر على الرغم من أن هذا قد يزعج من حوله. هم أشخاص محبين للعائلة والأجواء الحميمية، كذلك هم حساسون ورومانسيون جدا ولكن على شريكهم تحمل التغيير المزاجي الشديد لديهم.";
      break;
    }
    return {
      pros,
      cons,
      harmony,
      public
  }
}
// 0000000000000000000000000000000000000000000000000000
/**
 * Checks if year being passed to getZodiac is valid.
 * @param {number} year - A year to get validated.
 * @return {boolean} - if the year is valid or not.
 */
// NOTE: assumption being made that years are greater than or equal to 1000 A.D.
function yearIsntValid(year) {
  if (!year || typeof year != "number" || year.toString().length > 4) {
    return true;
  } else {
    return false;
  }
}

/**
 * Checks if month and date combo being passed to getHoroscope is valid.
 * @param {number} year - A year to get validated.
 * @return {boolean} - if the year is valid or not.
 */
function birthdayIsntValid(m, d) {
  if (
    typeof m != "number" ||
    typeof d != "number" ||
    m < 1 ||
    m > 12 ||
    d < 1 ||
    d > monthDayRange[m]
  ) {
    return true;
  } else {
    return false;
  }
}
// 0000000000000000000000000000000000000000000000000000
/**
 * gets Horoscope sign for given month/day
 * @param {number} month - number representing calendar month (1-12)
 * @param {number} day - number representing calendar day (1-31)
 * @param {boolean} overrideErrors - whether or not to throw error message or return null for non-valid
 * @return {string} sign - horoscope sign (i.e. 'Capicorn', 'Libra', 'Leo')
 */
function getSign(birthday, overrideErrors) {
  var { month, day } = birthday;
  let horo = handleMonths[month](day),
    pAc = prosAndConsHoro(horo);
  if (!overrideErrors) {
    overrideErrors = false;
  }
  if (overrideErrors) {
    if (birthdayIsntValid(month, day)) {
      return null;
    } else {
      return {
        name: horo,
        ...pAc,
      };
    }
  } else {
    if (birthdayIsntValid(month, day)) {
      throw new Error(
        "Horoscope.js/getSign: month should be numbers 1-12 and days should be numbers between 1-31"
      );
    } else {
      return {
        name: horo,
        ...pAc,
      };
    }
  }
}

/**
 * gets Zodiac animal for given year
 * @param {number} year - A year to get validated.
 * @param {boolean} overrideErrors - whether or not to throw error message or return null for non-valid
 * @return {string} sign - Zodiac sign (i.e. 'Monkey', 'Dragon')
 */
function getZodiac(year, overrideErrors) {
  let pAc = prosAndConsZodiac(ZodiacArray[year % 12]);
  if (!overrideErrors) {
    overrideErrors = false;
  }
  if (overrideErrors) {
    return yearIsntValid(year) ? null : ZodiacArray[year % 12];
  } else {
    if (yearIsntValid(year)) {
      throw new Error("Horoscope.js/getZodiac: Year provided isn't valid");
    } else {
      return {
        name: ZodiacArray[year % 12],
        ...pAc
      } 
    }
  }
}
